SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
  /* Camera I2C can become corrupted if the board was power-cycled or the
     program was interrupted while the camera was active. Retry up to 3 times
     with I2C bus reset between attempts instead of asserting. */
  if (!is_sensor_valid) {
    is_sensor_valid = 1;
    for (int attempt = 1; attempt <= 3; attempt++) {
      ret = CMW_CAMERA_GetSensorName(&sensor);
      if (ret == CMW_ERROR_NONE) break;
      printf("[CAM] I2C not ready (attempt %d/3, ret=%d)\n", attempt, ret);
      vTaskDelay(pdMS_TO_TICKS(200));
    }
    if (ret != CMW_ERROR_NONE) {
      printf("[CAM] FATAL: Cannot detect sensor after 3 retries (ret=%d)\n", ret);
      assert(0);
    }
  }

  cam_conf.width = SENSOR_WIDTH;
  cam_conf.height = SENSOR_HEIGHT;
  cam_conf.fps = conf->fps;
  cam_conf.mirror_flip = CAM_getFlipMode(sensor);
  ret = CMW_CAMERA_Init(&cam_conf, NULL);
  if (ret != CMW_ERROR_NONE) {
    printf("[CAM] Init failed (ret=%d), retrying with delay...\n", ret);
    vTaskDelay(pdMS_TO_TICKS(500));
    ret = CMW_CAMERA_Init(&cam_conf, NULL);
  }
  if (ret != CMW_ERROR_NONE) {
    printf("[CAM] FATAL: Init failed after retry (ret=%d)\n", ret);
    assert(0);
  }
  assert(cam_conf.width && cam_conf.height);
  DCMIPP_PipeInitCapture(conf, cam_conf.width, cam_conf.height, conf);
  return ret;
}

void CAM_SetSliceROI(uint16_t y_start, uint16_t height)
{
  CMW_DCMIPP_Conf_t conf;
  conf.manual_conf.offset_y = y_start;
  conf.manual_conf.height = height;
  CMW_CAMERA_SetPipeConfig(DCMIPP_PIPE1, &conf, NULL);
}

int CAM_CapturePipe_Start(uint8_t *dst, uint32_t mode)
{
  int ret = CMW_CAMERA_Start(DCMIPP_PIPE1, dst, mode);
#if PERF_DEBUG_LEVEL >= 1
  if (ret != CMW_ERROR_NONE) {
    printf("[CAM] Start failed mode=%lu ret=%d\n", (unsigned long)mode, ret);
  }
#endif
  return ret;
}

static int CAM_CapturePipe_StartRetry(uint8_t *dst, uint32_t mode, uint8_t retries)
{
  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();

  for (uint8_t attempt = 0; attempt <= retries; attempt++) {
    if (CAM_CapturePipe_Start(dst, mode) == CMW_ERROR_NONE) {
      return 0;
    }

    if (h) {
      HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
    }
    HAL_Delay(2);
  }

  return -1;
}

void CAM_IspUpdate(void)
{
  assert(CMW_CAMERA_Run() == CMW_ERROR_NONE);
}

void CAM_Deinit(void)
{
  assert(CMW_CAMERA_DeInit() == HAL_OK);
}

void CMW_CAMERA_PIPE_ErrorCallback(uint32_t pipe) { (void)pipe; }

static volatile uint32_t g_frame_count = 0;
static volatile int g_wait_frames = 0;
static volatile uint32_t g_frame_event_count = 0;
static volatile uint32_t g_vsync_count = 0;

void CAM_NotifyFrameEvent(void)
{
  g_frame_event_count++;
}

/**
 * @brief  Block until DCMIPP confirms a full frame has been DMA'd into
 *         capture_buf (CMW_CAMERA_PIPE_FrameEventCallback -> CAM_NotifyFrameEvent).
 *
 *   IMPORTANT: This must gate ONLY on the frame-complete event, not VSYNC.
 *   VSYNC marks the START of the next frame (sensor row-sync) and can fire
 *   slightly before DCMIPP finishes writing the previous frame to PSRAM.
 *   Gating on "vsync OR frame_event" (as before) could let the caller stop
 *   the pipe and memcpy a frame that is still being written -> partial/black
 *   or torn images, worse for a moving subject.
 * @return 0 on success, -1 on timeout (elapsed_ms optionally reports actual wait)
 */
static int CAM_WaitNextFrameReady(uint32_t timeout_ms, uint32_t *elapsed_ms)
{
  uint32_t start_evt = g_frame_event_count;
  uint32_t t0 = HAL_GetTick();

  while (g_frame_event_count == start_evt) {
    CAM_IspUpdate();
    vTaskDelay(pdMS_TO_TICKS(1));
    if (HAL_GetTick() - t0 > timeout_ms) {
      if (elapsed_ms) *elapsed_ms = HAL_GetTick() - t0;
      return -1;
    }
  }
  if (elapsed_ms) *elapsed_ms = HAL_GetTick() - t0;
  return 0;
}

void CAM_CountVsyncFrame(void)
{
  g_vsync_count++;
  if (g_wait_frames > 0) {
    g_frame_count++;
    if (g_frame_count >= (uint32_t)g_wait_frames)
      g_wait_frames = 0;
  }
}

void CAM_ResetFrameCounter(int wait_frames)
{
  g_frame_count = 0;
  g_wait_frames = wait_frames;
}

uint32_t CAM_GetFrameCount(void) { return g_frame_count; }

/* ================================================================
   ON-DEMAND SINGLE FRAME
   ================================================================ */
int CAM_CaptureSingleFrame(uint8_t *buf, int buf_size, int width, int height, int fps, int warmup_frames)
{
  int min_size = width * height * 2;
  if (buf == NULL || buf_size <= 0 || buf_size < min_size) return -1;
  if (warmup_frames < 1) warmup_frames = 8;

  PERF_MARK(g_perf_timer, CAM_INIT);
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Init camera %dx%d@%d YUV422 ...\n", width, height, fps);
#endif

  CAM_conf_t conf = {0};
  conf.capture_width = width;
  conf.capture_height = height;
  conf.fps = fps;
  conf.dcmipp_output_format = DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
  conf.is_rgb_swap = 0;
  CAM_Init(&conf);

  PERF_MARK(g_perf_timer, CAM_EXPO);
  CMW_CAMERA_SetExposureMode(CAM_EXPOSURE_MODE == 1 ? CMW_EXPOSUREMODE_MANUAL :
                             CAM_EXPOSURE_MODE == 2 ? CMW_EXPOSUREMODE_AUTOFREEZE : CMW_EXPOSUREMODE_AUTO);
  if (CAM_EXPOSURE_MODE == 1) {
    CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
    int32_t re, rg;
    CMW_CAMERA_GetExposure(&re);
    CMW_CAMERA_GetGain(&rg);
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Exposure=%ld Gain=%ld\n", (long)re, (long)rg);
#endif
  }

  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
  PERF_MARK(g_perf_timer, CAM_WARMUP);
  CAM_ResetFrameCounter(warmup_frames + 1);
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Start continuous (warmup=%d+1)...\n", warmup_frames);
#endif
  CAM_CapturePipe_Start(buf, CMW_MODE_CONTINUOUS);

  if (CAM_EXPOSURE_MODE == 1) {
    CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
  }

  uint32_t t0 = HAL_GetTick();
  while (g_wait_frames != 0) {
    CAM_IspUpdate();
    vTaskDelay(pdMS_TO_TICKS(5));
    if (HAL_GetTick() - t0 > 5000) {
#if PERF_DEBUG_LEVEL >= 1
      printf("[CAM] TIMEOUT %lu/%d\n", (unsigned long)g_frame_count, warmup_frames+1);
#endif
      HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
      CAM_Deinit();
      return -1;
    }
  }

  PERF_MARK(g_perf_timer, CAM_SNAP);
  PERF_MARK(g_perf_timer, CAM_STOP);
  HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
  HAL_Delay(5);
  SCB_InvalidateDCache_by_Addr((uint32_t*)buf, min_size);
  PERF_MARK(g_perf_timer, CAM_DEINIT);
  CAM_Deinit();
  return 0;
}

int CAM_CaptureSingleFrame_DefaultWarmup(uint8_t *buf, int bs, int w, int h, int fps)
{
  return CAM_CaptureSingleFrame(buf, bs, w, h, fps, 8);
}

/* ================================================================
   BATCH (ONE INIT, N FRAMES, ONE DEINIT)
   ================================================================ */
int CAM_CaptureBatchFrames(uint8_t *batch_buf, int frame_size, int frame_count, int width, int height, int fps)
{
  int min_size = width * height * 2;
  if (!batch_buf || frame_size < min_size || frame_count < 1) return -1;

#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Batch init %dx%d@%d (%d frames)...\n", width, height, fps, frame_count);
#endif
  CAM_conf_t conf = {0};
  conf.capture_width = width;
  conf.capture_height = height;
  conf.fps = fps;
  conf.dcmipp_output_format = DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
  conf.is_rgb_swap = 0;
  CAM_Init(&conf);

  CMW_CAMERA_SetExposureMode(CAM_EXPOSURE_MODE == 1 ? CMW_EXPOSUREMODE_MANUAL : CMW_EXPOSUREMODE_AUTO);
  if (CAM_EXPOSURE_MODE == 1) {
    CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
  }

